[
  {
    "id": "heppoko-ui",
    "name": "HeppokoUI",
    "url": "https://github.com/kotayam/heppoko-ui",
    "date": "In development",
    "description": "A simple and customizable React component library.",
    "language": ["React", "Vanilla-extract", "CI", "Vitest"]
  },
  {
    "id": "alice",
    "name": "Alice",
    "url": "https://github.com/kotayam/alice",
    "date": "In development",
    "description": "A game about discovering wonders in the real world.",
    "language": ["Go", "HTMX", "SQLite", "Leaflet", "Templ"]
  },
  {
    "id": "pokodb",
    "name": "PokoDB",
    "url": "https://github.com/kotayam/pokodb",
    "date": "December 2024",
    "description": "An in-memory database in C, allowing operations such as insert, select, update, and delete.",
    "more": "Utilizing threads and implementing a hash map to enable fast and efficient queries. Developing a CLI to interact and execute queries to the database, while handling signals like SIGINT. Creating a Javascript library to integrate with web/mobile applications, particularly for caching fetched data.",
    "language": ["C", "Database", "Threads", "Signal Handling"]
  },
  {
    "id": "c-react",
    "name": "C React",
    "url": "https://github.com/kotayam/c-react",
    "date": "March 2024",
    "description": "A dynamic web server in C allowing clients to create new items and view them on web pages.",
    "more": "Developed a IPv4 and TCP socket, which listens to client connections continuously. Implemented an HTTP request parser that extracts client data, and a custom HTML renderer for generating dynamic web pages.",
    "language": ["C", "Sockets"]
  },
  {
    "id": "notah",
    "name": "Notah",
    "url": "https://github.com/kotayam/notah",
    "date": "January 2024",
    "description": "An AI-powered note-taking app, which allows users to write prompts and receive text outputs from the GPT model directly in their note.",
    "more": "Utilized OpenAI API to integrate generative AI. Built a clean and efficient UI/UX using React and Tailwind. Developed a backend REST API with ASP.NET (C#) which communicates with a PostgreSQL database.",
    "language": ["React", "C#", "ASP.NET", "PostgreSQL", "Tailwind CSS"]
  },
  {
    "id": "pokechamp",
    "name": "PokéChamp",
    "url": "https://github.com/kotayam/pokechamp",
    "date": "June 2023",
    "description": "A platform for Pokémon trainers to create and share their favorite Pokémon party.",
    "more": "Utilized PokéAPI to display Pokémon data such as image, name, type. Developed a backend server with NodeJS and Express which communicates with a MongoDB database. Implemented user authentication using JWT.",
    "language": ["JavaScript", "NodeJS", "Express", "MongoDB", "JWT"]
  },
  {
    "id": "must-play-game-predictor",
    "name": "Must Play Game Predictor",
    "url": "https://github.com/kotayam/must-play-game-predictor",
    "date": "May 2023",
    "description": "A predictive model which identifies whether a video game should be classified as a Must Play game based on its reviews on Metacritic.",
    "more": "Built the model using text preprocessing and logistic regression against a Kaggle dataset with 5K games and 284K user reviews. The model achieved a prediction accuracy of 65.52% on test data.",
    "language": ["R", "Text Mining", "ggplot2"]
  },
  {
    "id": "flightimizer",
    "name": "Flightimizer",
    "url": "https://github.com/kotayam/flightimizer",
    "date": "May 2023",
    "description": "An application that recommends users the fastest flight from a source to a destination airport utilizing Dijkstra's algorithm.",
    "more": "Constructed a directed graph from a Kaggle dataset with 578K flight data, where edges are weighed by elapsed flight time.",
    "language": ["Java", "Python", "Pandas", "R", "network", "igraph"]
  }
]
